In [2]:
import pandas as pd

C:\Temp2\ipykernel_13700\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [3]:
s=pd.Series(['a','b','c','d'])
s

0    a
1    b
2    c
3    d
dtype: object

In [4]:
df=pd.DataFrame(s)
df

   0
0  a
1  b
2  c
3  d

In [5]:
df1=pd.DataFrame(s,columns=['Alphabets'])
df1

  Alphabets
0         a
1         b
2         c
3         d

In [6]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Alphabets  4 non-null      object
dtypes: object(1)
memory usage: 164.0+ bytes

In [7]:
df1['Alphabets']

0    a
1    b
2    c
3    d
Name: Alphabets, dtype: object

In [8]:
df1[['Alphabets']]

  Alphabets
0         a
1         b
2         c
3         d

In [9]:
dict={'Name':['Apurva','Aditya','Ameya','Swanand','Tani'],'Games':['Football','Cricket','Batminton','Cricket','Football'],'CGPA':[6,7,9,8,7]}

In [10]:
df2=pd.DataFrame(dict)
df2

      Name      Games  CGPA
0   Apurva   Football     6
1   Aditya    Cricket     7
2    Ameya  Batminton     9
3  Swanand    Cricket     8
4     Tani   Football     7

In [11]:
df2['Age']=[18,19,19,18,19]
df2

      Name      Games  CGPA  Age
0   Apurva   Football     6   18
1   Aditya    Cricket     7   19
2    Ameya  Batminton     9   19
3  Swanand    Cricket     8   18
4     Tani   Football     7   19

Adding new column

In [12]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Games   5 non-null      object
 2   CGPA    5 non-null      int64
 3   Age     5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

In [13]:
df2.shape

(5, 4)

In [14]:
df2.describe()

           CGPA        Age
count  5.000000   5.000000
mean   7.400000  18.600000
std    1.140175   0.547723
min    6.000000  18.000000
25%    7.000000  18.000000
50%    7.000000  19.000000
75%    8.000000  19.000000
max    9.000000  19.000000

In [15]:
df2.describe(include = 'all')

          Name     Games      CGPA        Age
count        5         5  5.000000   5.000000
unique       5         3       NaN        NaN
top     Apurva  Football       NaN        NaN
freq         1         2       NaN        NaN
mean       NaN       NaN  7.400000  18.600000
std        NaN       NaN  1.140175   0.547723
min        NaN       NaN  6.000000  18.000000
25%        NaN       NaN  7.000000  18.000000
50%        NaN       NaN  7.000000  19.000000
75%        NaN       NaN  8.000000  19.000000
max        NaN       NaN  9.000000  19.000000

In [16]:
df2.columns

Index(['Name', 'Games', 'CGPA', 'Age'], dtype='object')

In [17]:
df2

      Name      Games  CGPA  Age
0   Apurva   Football     6   18
1   Aditya    Cricket     7   19
2    Ameya  Batminton     9   19
3  Swanand    Cricket     8   18
4     Tani   Football     7   19

In [18]:
df2.columns=['n','g','c','a']
df2

         n          g  c   a
0   Apurva   Football  6  18
1   Aditya    Cricket  7  19
2    Ameya  Batminton  9  19
3  Swanand    Cricket  8  18
4     Tani   Football  7  19

renaming columns

In [19]:
df2.drop("g",axis=1,inplace=True)
df2

         n  c   a
0   Apurva  6  18
1   Aditya  7  19
2    Ameya  9  19
3  Swanand  8  18
4     Tani  7  19

deleting column--if axis=1 means column and axis=0 means row and inplace is by default false

And inplace assigns the new to current dataframe itself and if not used inplace we have to assign new dataframe to another one

In [20]:
#deleting rows
df2.drop(0,axis=0,inplace=True)
df2

         n  c   a
1   Aditya  7  19
2    Ameya  9  19
3  Swanand  8  18
4     Tani  7  19

In [21]:
df2.drop(1,axis=0,inplace=True)
df2

         n  c   a
2    Ameya  9  19
3  Swanand  8  18
4     Tani  7  19

Deleted rows 0 and 1

In [22]:
asc=df2.sort_values(by="c")
asc

         n  c   a
4     Tani  7  19
3  Swanand  8  18
2    Ameya  9  19

In [23]:
desc=df2.sort_values(by="c",ascending=False)
desc

         n  c   a
2    Ameya  9  19
3  Swanand  8  18
4     Tani  7  19

ascending is by default True, so in first case we dont need to write it

In [24]:
df2.to_csv("utkarsh.csv")

In [25]:
dict={'Name':['Apurva','Aditya','Ameya','Swanand','Tani'],'Games':['Football','Cricket','Batminton','Cricket','Football'],'CGPA':[6,7,9,8,7]}

In [26]:
df=pd.DataFrame(dict)
df

      Name      Games  CGPA
0   Apurva   Football     6
1   Aditya    Cricket     7
2    Ameya  Batminton     9
3  Swanand    Cricket     8
4     Tani   Football     7

In [27]:
pd.read_csv("utkarsh.csv")

   Unnamed: 0        n  c   a
0           2    Ameya  9  19
1           3  Swanand  8  18
2           4     Tani  7  19